Repository: FancyGoldfish07/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: de

source: Welcome to pyLottoSimu's documentation!
de: Willkommen bei der Dokumentation von pyLottoSimu!

source: The pyLottoSimu program generates random lottery numbers and can simulate a draw. In the simulation view a Lotto Ball is visible on the numbers rotate faster and faster, and is finally available, this is the text, the first number of today\'s draw was the ... Maybe it was indeed actually the numbers of the next draw, of course are here, all the figures provided without guarantee.
de: Das pyLottoSimu Programm generiert zufällige Lottozahlen und kann eine Ziehung simulieren. In der Simulationsansicht ist eine Lottokugel sichtbar, auf der die Zahlen immer schneller rotieren, Und schließlich stehen bleibt, dazu kommt der Text, die erste Zahl der heutigen Ziehung war die ... Vielleicht waren es ja tatsächlich die Zahlen der nächsten Ziehung, natürlich sind auch hier, alle Zahlen ohne Gewähr.

source: The program requires Python_ 2.7 or 3.x and `Qt5 for Python`_.
de: Das Programm verwendet Python_ 2.7 oder 3.x und `Qt5 for Python`_.

source: Start with::
de: Start mit::

source: Documentation
de: Dokumentation

source: Make the documentation as .html file::
de: Dokumentation als .html Datei aus den Kommentaren des Quelltextes erstellen lassen::

source: Contents:
de: Inhalt

source: Indices and tables
de: Indizes und Tabellen

source: Lotto Generator and Simulator
de: Lotto Generator und Simulator

source: a simulation of Lotto Germany (pick 6 out of 49), Lotto Austria (pick 6 out of 45), EuroMillionen, Powerball Lottery US, Mega Millions lottery and Hot Lotto Sizzler system.
de: Eine Simulation des Lotto Deutschland (6 aus 49), Lotto Österreich (6 aus 45), Euromillionen, Powerball-Lotterie der USA, Mega Millions Lotterie und Hot Lotto Sizzler.

source: pyLottoSimu can be started in these languages:
de: pyLottoSimu kann in diesen Sprachen gestartet werden:

source: English, German, French, Spanish, Italian, Danish, Dutch, Polish and Russian
de: Englisch, Deutsch, Französisch, Spanisch, Italienisch, Dänisch, Niederländisch, Polnisch und Russisch
