Repository: FancyGoldfish07/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/pylottosimu.po
Languages: de

source: pylottosimu package
de: pylottosimu Sammlung

source: Subpackages
de: Unterpakete

source: Submodules
de: Untermodule

source: pylottosimu.lottosystem module
de: pylottosimu.lottosystem Modul

source: pylottosimu.pylotto module
de: pylottosimu.pylotto Modul

source: The signals for the GUI
de: Signale für die GUI

source: none
de: keine

source: show dialog of the draw
de: Auslosung Dialog zeigen

source: Start simulation with the first drawing init timer with the valve from the Scrollbar the next drawing starts with the timer event.
de: Simulation starten mit der ersten Zeichnung, die Zeit wird in der Scrollbar eingestellt

source: Clean the output text
de: Den Ausgabetext löschen

source: Close the GUI
de: GUI beenden

source: info message box
de: Info Meldung

source: Show the output from the random number generator.
de: Zeigen die Ausgabe von dem Zufallszahlengenerator.

source: Start time to show a number.
de: Startzeit, um eine Nummer zu zeigen.

source: Open website
de: Webseite öffnen

source: Simulation of the draw and show the next Number on the Screen.
de: Simulation der Auslosung und zeigen die nächste Nummer auf dem Bildschirm.

source: draw of the lotto numbers
de: Zeichnen der Lottozahlen

source: pick of a lotto number
de: Ziehen einer Lotto-Nummer

source: pick
de: Nummer ziehen

source: pylottosimu.test_lottosystemdata module
de: pylottosimu.test_lottosystemdata Modul

source: pylottosimu.test_pep8 module
de: pylottosimu.test_pep8 Modul

source: Test that we conform to PEP8.
de: Test, dass wir PEP8 entsprechen.

source: pylottosimu.test_show_drawing module
de: pylottosimu.test_show_drawing Modul

source: Test of drawing
de: Test der Zeichnung

source: Creates the QApplication instance
de: Erzeugt das QApplication Instanz

source: Deletes the reference owned by self
de: Löscht den Referenz durch Eigenbesitz

source: Module contents
de: Modulinhalte

source: data
de: Daten

source: open in the home path and create a direction.
de: Öffnen Sie im Home-Pfad und eine Richtung.

source: read lottosystems.json
de: Lesen lottosystems.json

source: The GUI and program of the pyLottoSimu.
de: Die GUI und das Programm der pyLottoSimu.

source: Changing the layout for simulation or generation and change the visible of the buttons.
de: Ändern des Layouts für die Simulation oder die Erzeugung und ändern Sie die sichtbar von den Tasten.

source: simulate a lotto draw
de: Simuliere eine Lottoziehung

source: name of game
de: Name des Spiels

source: maximal draw numbers
de: Anzahl der Nummern

source: the draw numbers
de: Die Losnumern

source: with additional number
de: mit Zusatzzahlen

source: the additional numbers
de: Die Zusatzzahlen

source: separates additional numbers
de: seperate Zusatzzahlen

source: maximal additional numbers
de: Maximale Anzahl der Zusatzzahlen

source: Test the code format of the file
de: Testen des Code Format der Datei

source: read the lottosystems.json file
de: lesen der lottosystems.json Datei

source: test the dialog module
de: testen des Dialogmodul

source: path of the project
de: Pfad des Projekts

source: Init class pylotto.drawlotto
de: Init-Klasse pylotto.drawlotto

source: test draw without a additional number
de: Teste Ziehung ohne eine Zusatzzahl

source: test draw with a additional number
de: Teste Ziehung mit einer Zusatzzahl

source: test draw with a separate additional number
de: Teste Ziehung mit einer seperaten Zusatzzahl

source: Dataset:
de: Datensatz

source: name: name of the lottery system,
de: Name: Name des Lotterie-System,

source: max_draw: highest number of draw
de: max_draw: höchste Zahl der Auslosung

source: draw_numbers: number to pick
de: draw_numbers: Anzahl der Ziehungen

source: with_addit: with additional number
de: with_addit: mit Zusatzzahl

source: sep_addit_numbers: with separate additional number, the additional number are not in the same pot
de: sep_addit_numbers: mit separaten Zusatzzahl, die zusätzliche Zahl nicht in den gleichen Topf

source: addit_numbers: additional number to pick
de: addit_numbers: mit Zusatzzahlen

source: max_addit: highest additional number in the separate pot
de: max_addit: höchste Zusatzzahl in dem separaten Topf

source: Data of predefined lottery system.
de: Daten der vordefinierten Lotterie-Systeme.

source: The following are predefined: Lotto Germany (pick 6 out of 49), Lotto Austria (pick 6 out of 45), EuroMillionen, Powerball Lottery US, Mega Millions, Hot Lotto Sizzler
de: Die folgenden sind vordefiniert: Lotto Deutschland (6 aus 49), Lotto Österreich (6 aus 45), Euromillionen, Powerball-Lotterie der USA, Mega Millions, Hot Lotto Sizzler

source: If you miss your favorite lottery system than could you add here.
de: Wenn Sie ihre Lieblings-Lotterie-System vermissen, könnten sie es hier hinzufügen.

source: write lottosystems.json
de: Schreiben lottosystems.json

source: class LottoSimuDialog
de: Klasse LottoSimuDialog

source: The GUI and program of the pyLottoSimu. Use the lottosimu_gui.ui
de: Die GUI und das Programm der pyLottoSimu. Verwenden Sie die lottosimu_gui.ui

source: class drawlotto
de: Klasse drawlotto

source: simulate a lotto draw. draw the lotto numbers and give the draw text back
de: simulieren eine Lotto-Auslosung. ziehen die Lottozahlen und geben die Auslosung Text zurück

source: test draw one number without a additional number
de: Test ziehen Zahl ohne Zusatz

source: test draw three number without a additional number
de: Test ziehen drei Zahl ohne Zusatz

source: test draw two number without a additional number
de: Test zeichnen Sie zwei Nummer ohne zusätzliche Anzahl

source: test set draw to no number and make sure to set to one number
de: Test-Set bis gar keine Nummer ziehen und sicherstellen, dass auf eine Zahl gesetzt

source: test with one ball numbers
de: Test mit einer Ziehung

source: test ball numbers and bonus numbers in a maximal draw of 5 numbers
de: Test Ziehungen und Bonus-Nummern mit 5 Zahlen in der Auslosung

source: test separate bonus numbers
de: Test separaten Zusatzzahlen

source: test with higher draw numbers as the highest number in the draw in the ballnumbers and in the bonusnumbers
de: Test mit höhere Zahl der Ziehungen als die höchste Zahl der Nummern

source: test the same ball numbers and bonus numbers in a maximal draw of 5 numbers
de: test die gleiche Kugelnummern und Bonus-Nummern in einem Maximal Auslosung der 5 Zahlen

source: test with two ball numbers
de: Test mit zwei Nummern

source: The class lottosystemdata loads predefined lottery systems. And read and write a json file of the data set.
de: Die Klassen lottosystemdata ladet die vorgegeben Lotteriesysteme. Und Lesen und Schreiben einer JSON-Datei des Datensatzes.
