Repository: FancyGoldfish07/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/pylottosimu.dialog.po
Languages: de

source: pylottosimu.dialog package
de: pylottosimu.dialog Paket

source: Submodules
de: Submodule

source: pylottosimu.dialog.show_drawing module
de: pylottosimu.dialog.show_drawing Modul

source: Show the numbers in a dialog box
de: Anzeige der Numern in der Dialogbox

source: Module contents
de: Modulinhalte

source: pylottosimu.dialog.lottosettingdialog module
de: pylottosimu.dialog.lottosettingdialog Modul

source: The GUI of Settings.
de: Die GUI von Einstellungen.

source: Lotto setting
de: Lotto-Einstellung

source: parent window
de: Eltern-Fenster

source: static method to create the dialog and return (dialog.values, accepted)
de: statische Methode, um den Dialog zu erstellen und (dialog.values, akzeptiert)

source: dialog.values, accepted
de: dialog.values, akzeptiert

source: Set Values
de: Werte setzen

source: Values
de: Werte

source: the number of draw
de: die Zahl der Ziehung

source: the number of the PushButtons
de: die Anzahl der Tasten

source: the bonus numbers
de: die Bonuszahlen

source: the highest bonus number (separate numbers)
de: die höchste Zusatzzahl (separate Nummern)

source: None
de: Keine

source: Array of buttons from 1 to the highest number and buttons for the additional numbers
de: Reihe von Tasten von 1 bis zur höchsten Zahl und Schaltflächen für die zusätzlichen Nummern

source: class LottoSettingsDialog
de: Klasse LottoSettingsDialog

source: The GUI of Settings. Use lottosystem.ui.
de: Die GUI von Einstellungen. Verwenden lottosystem.ui.

source: class DlgShowDrawing
de: Klasse DlgShowDrawing

source: show a Dialog with all the ball numbers from the draw and the bonus numbers.
de: zeigen einen Dialog mit allen Ball Zahlen von der Auslosung und der Bonus-Nummern.
